"use strict";
alert("Предлагаю пройти шуточный тест под названием 'Письмо Деду Морозу', который состоит из 13 вопросов, отвечать надо не раздумывая и что первое приходит в голову, нажмите ОК, чтобы продолжить.");
let a = prompt("1.Твоё имя?");
let b = prompt("2.Любая фраза.")
let c = prompt("3.Как бы ты назвал(а) человека, который предал тебя?")
let d = prompt("4.Какое ты знаешь ругательство? Ругнись!")
let e = prompt("5.Профессия?")
let f = prompt("6.Что будет собаке, если скинуть её с 9-го этажа?")
let g = prompt("7.Каково обычно после большой пьянки?")
let h = prompt("8.Что не хватает в твоём доме?")
let i = prompt("9.Бытовой предмет.")
let j = prompt("10.Что тебе хочется сейчас?")
let k = prompt("11.В каком месте не станут искать?")
let l = prompt("12.Как зовут твою собаку? если нет, то как бы ты её назвала?")
let m = prompt("13.Нехороший человек - ...")

alert(`Здравствуй Дедушка Мороз !
Меня зовут ${a}. Я верю и надеюсь в то, что ты есть и сейчас читаешь моё письмо. Моя мама очень злая тётя. Она не разрешает писать мне письма тебе, и поэтому я сижу в ${k} и пишу это письмо. Когда я её не слушаюсь, она бросает в меня ${i}. Однажды я не вытерпел и сказал ей: - ${b}. Мой папа работает ${e} и приходя с работы с плохим настроением, он кричит: - ${d}.Ещё папа придумал мне кличку, и зовёт меня не ${a}, а ${l}! Это очень обидно. В общем, дедушка мороз, если ты не ${m} , то ты поймёшь как мне ${g}. Дорогой Дедушка мороз, забери меня к себе или вышли мне ${i}. Ещё сделай так, что бы близкие мне люди любили меня и почаще давали мне денег на ${j}. Любимый дед мороз, ты мой последний шанс. Я надеюсь на новый год я найду под ёлочкой ${h}. Дед Мороз, пойми как мне ${g}. Если ты не прочтёшь это письмо или оно не дойдёт до тебя, мне ${f}. Помни что я верю в тебя ${c}!
 
P.s: ${a}.`)